# PROYECTO 1

## Ejercicio 1

In [4]:
import pandas as pd
import numpy as np

In [22]:
diccionario = {
    "Fecha": ["12-01-2022","13-01-2022","14-01-2022","15-01-2022"],
    "Precio Unit":[15.50, 3.50, 2.20,5],
    "Ventas":[23, 40, 100, 76]
}

df = pd.DataFrame(diccionario)

In [23]:
df

        Fecha  Precio Unit  Ventas
0  12-01-2022         15.5      23
1  13-01-2022          3.5      40
2  14-01-2022          2.2     100
3  15-01-2022          5.0      76

In [24]:
df['Ganancia'] = df['Ventas']*df['Precio Unit']
df['Ganancia - Desc 5%'] = (df['Precio Unit'] - df['Precio Unit']*0.005).round(2)*df['Ventas']

In [25]:
df

        Fecha  Precio Unit  Ventas  Ganancia  Ganancia - Desc 5%
0  12-01-2022         15.5      23     356.5              354.66
1  13-01-2022          3.5      40     140.0              139.20
2  14-01-2022          2.2     100     220.0              219.00
3  15-01-2022          5.0      76     380.0              377.72

## Ejercicio 2

In [43]:
ingreso = {
    "empleado1":200,
    "empleado2":435,
    "empleado3":567,
    "empleado4":123,
    "empleado5":657,
    "empleado6":876,
    "empleado7":1023
}

tr = pd.DataFrame(ingreso.values())
tr.describe().round(1)

            0
count     7.0
mean    554.4
std     331.6
min     123.0
25%     317.5
50%     567.0
75%     766.5
max    1023.0

## Ejercicio 3

In [30]:
dict3 = {
    "Mes":["Enero", "Febrero", "Marzo", "Abril", "Mayo"],
    "Ventas":[30500, 35600, 28300, 33900, 42500],
    "Gastos":[22000, 23450, 18100, 35700, 32450]
}

In [31]:
df3 = pd.DataFrame(dict3)
df3

       Mes  Ventas  Gastos
0    Enero   30500   22000
1  Febrero   35600   23450
2    Marzo   28300   18100
3    Abril   33900   35700
4     Mayo   42500   32450

In [32]:
# 1. Columna 1 = Gasto/Ventas*100

df3['Columna 1'] = (df3['Gastos']/df3['Ventas'])*100
df3

       Mes  Ventas  Gastos   Columna 1
0    Enero   30500   22000   72.131148
1  Febrero   35600   23450   65.870787
2    Marzo   28300   18100   63.957597
3    Abril   33900   35700  105.309735
4     Mayo   42500   32450   76.352941

In [33]:
# 2. Columna 2 = Si Ventas>= 30000, imprimir “Meta Superada”, caso contrario imprimir “Meta no Superada”.

df3['Columna 2'] = ["Meta superada" if val >= 30000 else "Meta no superada" for val in df3['Ventas']]
df3

       Mes  Ventas  Gastos   Columna 1         Columna 2
0    Enero   30500   22000   72.131148     Meta superada
1  Febrero   35600   23450   65.870787     Meta superada
2    Marzo   28300   18100   63.957597  Meta no superada
3    Abril   33900   35700  105.309735     Meta superada
4     Mayo   42500   32450   76.352941     Meta superada

In [35]:
# 3. Columna 3 = Si Gasto>Ventas, calcular el sobre gasto.
df3['Columna 3'] = np.where(df3['Gastos']>df3['Ventas'], df3['Gastos']-df3['Ventas'], 0)
df3

       Mes  Ventas  Gastos   Columna 1         Columna 2  Columna 3
0    Enero   30500   22000   72.131148     Meta superada          0
1  Febrero   35600   23450   65.870787     Meta superada          0
2    Marzo   28300   18100   63.957597  Meta no superada          0
3    Abril   33900   35700  105.309735     Meta superada       1800
4     Mayo   42500   32450   76.352941     Meta superada          0

In [36]:
# 4. Obtener el total de las ventas de los últimos 3 meses

df3.tail(3)

     Mes  Ventas  Gastos   Columna 1         Columna 2  Columna 3
2  Marzo   28300   18100   63.957597  Meta no superada          0
3  Abril   33900   35700  105.309735     Meta superada       1800
4   Mayo   42500   32450   76.352941     Meta superada          0

In [40]:
# 5. Obtener el total de gastos de febrero a abril
df3[df3['Mes'].isin(['Febrero', 'Marzo', 'Abril'])]

       Mes  Ventas  Gastos   Columna 1         Columna 2  Columna 3
1  Febrero   35600   23450   65.870787     Meta superada          0
2    Marzo   28300   18100   63.957597  Meta no superada          0
3    Abril   33900   35700  105.309735     Meta superada       1800